; domain
(define (domain robot_chef)
    (:requirements :strips :typing :fluents :negative-preconditions :disjunctive-preconditions)

    ;; Define types and type hierarchy
    (:types
        robot; Define a type for the robot
        room; Define a type for locations/rooms
        item; Define a general type 'item' for anything the robot might hold
        ingredient tool dish - item; 'ingredient', 'tool', and 'dish' are subtypes of 'item'
        )

    (:functions
        (ingredient-quantity ?i - ingredient) ;; Fluents for managing the quantity of each ingredient.
    )

    (:predicates
        ;; Basic predicates
        (robot-at ?r - robot ?room - room); The robot is in a specific room.
        (holding ?item - item); The robot is holding an item.
        (adjacent ?room1 - room ?room2 - room); The rooms are adjacent.

        (tool-at ?tool - tool ?room - room); A tool is in a specific room.
        (tool-clean ?tool - tool); A tool is clean.

        (dish-at ?dish - dish ?room - room); A dish is in a specific room.
        (dish-prepared ?dish - dish); The dish is fully prepared.

        (ingredient-at ?ingredient - ingredient ?room - room); An ingredient is in a specific room.
        (ingredient-prepared ?ingredient - ingredient); The ingredient is prepared .
        (ingredient-cooked ?ingredient - ingredient); The ingredient is cooked.

        (is-storage-room ?room - room); The room is the storage room.
        (is-cooking-room ?room - room); The room is the cooking room.
        (is-serving-room ?room - room); The room is the serving room.
        (is-preparation-room ?room - room); The room is the preparation room.
        (is-dishwashing-room ?room - room); The room is the dishwashing room.
        (is-cutting-room ?room - room); The room is the cutting room.
        (is-mixing-room ?room - room); The room is the mixing room.

        ;; Helpers to bind specific ingredients to rooms
        (ingredient-prep-room ?ingredient - ingredient ?room - room); Ingredient must be prepared in a specific room.
        (ingredient-cook-room ?ingredient - ingredient ?room - room); Ingredient must be cooked in a specific room.

        ;; Requirements between dishes and ingredients (define recipe)
        (ingredient-used-in-dish ?ingredient - ingredient ?dish - dish) ;; Link ingredient to a specific dish
        (require-prepared ?dish - dish ?ingredient - ingredient); The dish requires a prepared ingredient.
        (require-cooked ?dish - dish ?ingredient - ingredient); The dish requires a cooked ingredient.
    )

    ; Actions

    ; The robot moves from its current room to an adjacent one.
    (:action move
        :parameters (?robot - robot ?from - room ?to - room)
        :precondition (and
            (robot-at ?robot ?from)
            (adjacent ?from ?to)
        )
        :effect (and
            (robot-at ?robot ?to)
            (not (robot-at ?robot ?from))
        )
    )

    ;; The robot picks up an ingredient from the storage area.
    (:action pick-up-ingredient
        :parameters (?robot - robot ?ingredient - ingredient ?room - room)
        :precondition (and
            (robot-at ?robot ?room)
            (ingredient-at ?ingredient ?room)
            (not (holding ?ingredient)); Verify that the robot does not already hold something (limited to 1).
            (is-storage-room ?room); ingredients are only in the storage room.
            (> (ingredient-quantity ?ingredient) 0); The quantity of ingredient must be more than 0.
        )
        :effect (and
            (holding ?ingredient)
            (not (ingredient-at ?ingredient ?room))
            (decrease (ingredient-quantity ?ingredient) 1) ;; Decrease the quantity of the picked-up ingredient.
        )
    )

    ;; The robot prepares an ingredient (e.g., cuts, mixes) in the appropriate room.
    (:action prepare-ingredient
        :parameters (?robot - robot ?ingredient - ingredient ?room - room)
        :precondition (and
            (robot-at ?robot ?room)
            (ingredient-prep-room ?ingredient ?room); The ingredient must be prepared in the specified room.
            (holding ?ingredient); The robot must hold the ingredient to prepare it.
            ;(not (ingredient-prepared ?ingredient)); The ingredient must not be already prepared.
        )
        :effect (and
            (ingredient-prepared ?ingredient)
        )
    )

    ;; The robot cooks an ingredient in the cooking area.
    (:action cook-ingredient
        :parameters (?robot - robot ?ingredient - ingredient ?room - room)
        :precondition (and
            (is-cooking-room ?room)
            (robot-at ?robot ?room)
            (ingredient-cook-room ?ingredient ?room); The ingredient must be cooked in the specified room.
            (ingredient-prepared ?ingredient); The ingredient must be prepared before cooking.
            (holding ?ingredient); The robot must hold the ingredient to cook it.
            ;(not (ingredient-cooked ?ingredient)); The ingredient must not be already cooked.
        )
        :effect (and
            (ingredient-cooked ?ingredient)
        )
    )

    ;; The robot assembles a dish from prepared ingredients in the preparation area.
    (:action assemble-dish
        :parameters (?r - robot ?dish - dish ?room - room)
        :precondition (and
            (robot-at ?r ?room)
            (is-preparation-room ?room)
            ;; Precondition to ensure all ingredients are either prepared or cooked as required
            (forall
                (?ingredient - ingredient)
                (or
                    (and (ingredient-used-in-dish ?ingredient ?dish) (require-prepared ?dish ?ingredient) (ingredient-prepared ?ingredient))
                    (and (ingredient-used-in-dish ?ingredient ?dish) (require-cooked ?dish ?ingredient) (ingredient-cooked ?ingredient)))))
        :effect (dish-prepared ?dish)
    )

    ;; The robot plates the finished dish in the serving area.
    ; (:action plate-dish
    ;     :parameters (?robot - robot ?room - room ?dish - dish)
    ;     :precondition (and
    ;         (is-preparation-room ?room)
    ;         (robot-at ?robot ?room)
    ;         (dish-prepared ?dish)
    ;     )
    ;     :effect (and

    ;     )
    ; )

    ;; The robot cleans a tool in the dishwashing area.
    ; (:action clean-tool
    ;     :parameters ()
    ;     :precondition (and

    ;     )
    ;     :effect (and

    ;     )
    ; ))
)

; problem
(define (problem basic)
    (:domain robot_chef)

    (:objects
        storage-room preparation-room cooking-room serving-room dishwashing-room cutting-room mixing-room - room
        sushi - dish
        knife - tool
        rice fish vegetable - ingredient
        chef - robot
    )

    (:init
        ;; Initial room of the robot
        (robot-at chef cooking-room)

        ;; Ingredients in the storage
        (ingredient-at rice storage-room)
        (ingredient-at fish storage-room)
        (ingredient-at vegetable storage-room)

        ;; Fluent ingredient quantities
        (= (ingredient-quantity rice) 1)
        (= (ingredient-quantity fish) 1)
        (= (ingredient-quantity vegetable) 1)

        ;; Bind ingredients to specific prep/cooking room
        (ingredient-prep-room rice mixing-room); Rice must be prepared in Mixing room
        (ingredient-prep-room fish cutting-room); Fish must be cut in Cutting room
        (ingredient-prep-room vegetable cutting-room); Vegetables must be cut in Cutting room
        (ingredient-cook-room rice cooking-room); Rice must be cooked in Cooking room

        ;; Bind dishes to ingredients
        (ingredient-used-in-dish rice sushi)
        (ingredient-used-in-dish fish sushi)
        (ingredient-used-in-dish vegetable sushi)

        ;; Define dish requirements for its ingredient
        (require-prepared sushi vegetable)
        (require-prepared sushi fish)
        (require-cooked sushi rice)

        ;; Set each room with a predicate
        (is-storage-room storage-room)
        (is-preparation-room preparation-room)
        (is-cooking-room cooking-room)
        (is-serving-room serving-room)
        (is-dishwashing-room dishwashing-room)
        (is-cutting-room cutting-room)
        (is-mixing-room mixing-room)

        ;; Tool setup
        (tool-at knife dishwashing-room)
        (tool-clean knife)

        ;; Adjacency between rooms
        (adjacent serving-room cooking-room)
        (adjacent cooking-room serving-room)
        (adjacent cooking-room dishwashing-room)
        (adjacent dishwashing-room cooking-room)
        (adjacent preparation-room dishwashing-room)
        (adjacent dishwashing-room preparation-room)
        (adjacent preparation-room cooking-room)
        (adjacent cooking-room preparation-room)
        (adjacent mixing-room preparation-room)
        (adjacent preparation-room mixing-room)
        (adjacent mixing-room cutting-room)
        (adjacent cutting-room mixing-room)
        (adjacent storage-room mixing-room)
        (adjacent mixing-room storage-room)
        (adjacent cutting-room storage-room)
        (adjacent serving-room cutting-room)

    )

    (:goal
        (and
            (dish-prepared sushi)
            ; (dish-at sushi serving-room)
            ; (tool-clean knife)
        )

    )
)

; plan
1. (move chef cooking-room preparation-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 1
2. (move chef preparation-room mixing-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 1
3. (move chef mixing-room storage-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef storage-room)
   goals met: 0 of 1
4. (pick-up-ingredient chef vegetable storage-room)
   deleted: (ingredient-at vegetable storage-room)
   added: (holding vegetable)
   changed: (ingredient-quantity vegetable) from 1 to 0
   goals met: 0 of 1
5. (pick-up-ingredient chef fish storage-room)
   deleted: (ingredient-at fish storage-room)
   added: (holding fish)
   changed: (ingredient-quantity fish) from 1 to 0
   goals met: 0 of 1
6. (pick-up-ingredient chef rice storage-room)
   deleted: (ingredient-at rice storage-room)
   added: (holding rice)
   changed: (ingredient-quantity rice) from 1 to 0
   goals met: 0 of 1
7. (move chef storage-room mixing-room)
   deleted: (robot-at chef storage-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 1
8. (move chef mixing-room cutting-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef cutting-room)
   goals met: 0 of 1
9. (prepare-ingredient chef vegetable cutting-room)
   added: (ingredient-prepared vegetable)
   goals met: 0 of 1
10. (prepare-ingredient chef fish cutting-room)
   added: (ingredient-prepared fish)
   goals met: 0 of 1
11. (move chef cutting-room mixing-room)
   deleted: (robot-at chef cutting-room)
   added: (robot-at chef mixing-room)
   goals met: 0 of 1
12. (prepare-ingredient chef rice mixing-room)
   added: (ingredient-prepared rice)
   goals met: 0 of 1
13. (move chef mixing-room preparation-room)
   deleted: (robot-at chef mixing-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 1
14. (move chef preparation-room cooking-room)
   deleted: (robot-at chef preparation-room)
   added: (robot-at chef cooking-room)
   goals met: 0 of 1
15. (cook-ingredient chef rice cooking-room)
   added: (ingredient-cooked rice)
   goals met: 0 of 1
16. (move chef cooking-room preparation-room)
   deleted: (robot-at chef cooking-room)
   added: (robot-at chef preparation-room)
   goals met: 0 of 1
17. (assemble-dish chef sushi preparation-room)
   added: (dish-prepared sushi)
   goals met: 1 of 1
